system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
	inlet 	{type triSurfaceMesh;file "inlet.obj";}
	outlet 	{type triSurfaceMesh;file "outlet.obj";}
	wall 	{type triSurfaceMesh;file "wall.obj";}
	absorber{type triSurfaceMesh;file "absorber.obj";}
	Box 	{type searchableBox;min (-0.1 -0.1 -0.1);max (0.1 0.1 0.1);}
};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters

    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;	//0
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 20;	//3

    // Explicit feature edge refinement

    features
    (
	{file "impactor.eMesh";	level 1;}
    );

    // Surface based refinement

    refinementSurfaces
    {
	inlet 	 {level (1 1);patchInfo {type wall;inGroups (impactorGroup);}}
	outlet   {level (1 1);patchInfo {type wall;inGroups (impactorGroup);}}
	wall	 {level (1 1);patchInfo {type wall;inGroups (impactorGroup);}}
	absorber {level (1 1);patchInfo {type wall;inGroups (impactorGroup);}}

    }

    resolveFeatureAngle 30;		//default
    planarAngle 30;			

    // Region-wise refinement

    refinementRegions
    {

        box {mode inside;levels ((1E15 1));}
    }

    // Mesh selection

    locationInMesh (0 0 0.001); 

    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100;		//30
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    // Layer thickness specification. This can be specified in one of following ways:
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness
    // - overall thickness and expansionRatio

    expansionRatio 1.2;
    finalLayerThickness 0.7;
    //firstLayerThickness 0.1;
    //thickness 0.6;
    //minThickness 0.25;
    minThickness 0.01; //0.1

    layers
    {
	//inlet {nSurfaceLayers 4;expansionRatio 1.2;finalLayerThickness 0.5;minThickness 0.1;}
	inlet 		{nSurfaceLayers 3;}
	outlet		{nSurfaceLayers 3;}
	wall 		{nSurfaceLayers 3;}
	absorber	{nSurfaceLayers 3;}
	//impactor{nSurfaceLayers 4;}
	
    }

        nGrow 0;

        //featureAngle 0;		//no inflation
        //featureAngle 60;
        //featureAngle 130;		//default
        //featureAngle 270;
        featureAngle 330;		//default

        maxFaceThicknessRatio 0.5; 
	nSmoothSurfaceNormals 1;
        nSmoothThickness 10;
        minMedialAxisAngle 90;
        minMedianAxisAngle 90;
        maxThicknessToMedialRatio 0.3;     
        nSmoothNormals 3;

	//nMedialAxisIter  10;
	//nSmoothDisplacement  90;
      	//detectExtrusionIsland  true;

	slipFeatureAngle 30;
	nRelaxIter 10;		//5	//3
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;		//*****

        additionalReporting true;	//*****
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed				//*****
    {
        maxNonOrtho 75; // Maximum non-orthogonality allowed. Set to 180 to disable.
    }

    // Advanced
    nSmoothScale 4;
    errorReduction 0.75;
}

// Advanced

//debug 0;   //3

//// Debug flags
debugFlags
(
    //mesh            // write intermediate meshes
    //intersections   // write current mesh intersections as .obj files
    //featureSeeds    // write information about explicit feature edge refinement
    //attraction      // write attraction as .obj files
    //layerInfo       // write information about layers
);

//// Write flags
writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
